      * Standard Field Entry. 
      * Pseudocode for standard field entry. 
       enter-the data. 
           PERFORM accept-the-data.
           PERFORM re-accept-the-data.
              UNTIL the-data is valid. 
       accept-the-data.
           DISPLAY a-prompt.
           ACCEPT the-data. 
       re-accept-the-data 
           DISPLAY error-message. 
           PERFORM accept-the-data. 

           