      * An illegal REDEFINES. 
       01  DATE-CCYYMMDD           PIC 9(6). 
       01  A-DATE REDEFINES   DATE-CCYMMDD.
           05 DATE-CC              PIC 99. 
           05 DATE-YY               PIC 99. 
           05 DATE-MM               PIC 99. 
           05 DATE-DD               PIC 99. 
    


