      * Zero suppression in a formatted date 
       77  FORMATTED-DATE          PIC z9/99/9999.
           MOVE 05151997   TO FORMATTED-DATE. 
           DISPLAY FORMATTED-DATE. 
       