      * DATE-CCYYMMDD IS A PIC X(8).
       01  DATE-CCYYMMDD.
           05 DATE-CC              PIC 99. 
           05 DATE-YY              PIC 99.
           05 DATE-MM              PIC 99. 
           05 DATE-DD              PIC 99. 
           