      * A  structure variable.
       01  ALL-THE-VARIABLES.
           05 1ST-NUMBER           PIC 99. 
           05 2ND-NUMBER           PIC 99. 
           05 3RD-NUMBER           PIC 99. 
       