      * MULTIPLE IF ELSE statements
       DO-THE-PICK.
           IF MENU-PICK = 1 
               PERFORM ADD-MODE 
           ELSE 
           IF MENU-PICK = 2 
               PERFORM CHANGE-MODE 
           ELSE 
           IF MENU-PICK = 3 
               PERFORM INQUIRE-MODE 
           ELSE 
           IF MENU-PICK = 4 
               PERFORM DELETE-MODE. 
       