      * Indented IF ELSE statements 
       DO-THE-PICK.
           IF MENU-PICK = 1 
               PERFORM ADD-RECORDS 
           ELSE 
               IF MENU-PICK = 2 
                   PERFORM CHANGE-RECORDS 
               ELSE 
                   IF MENU-PICK = 3 
                       PERFORM LOOK-UP-RECORDS 
                   ELSE 
                       IF MENU-PICK = 4 
                           PERFORM DELETE-RECORDS.

       