      * Using COPY files. 
       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL. 

           COPY "SLVND01.CBL".

       DATA DIVISION. 
       FILE SECTION. 

           COPY "FDVND01.CBL".
           