      * Trapping at END 

       READ-NEXT-VENDOR RECORD. 
           READ VENDOR-FILE NEXT RECORD 
                AT END MOVE "Y" TO END-OF-FILE. 

                