       FD VENDOR-FILE
001200 LABEL RECORDS ARE STANDARD.
001300 01 VENDOR-RECORD.
001400     05 VENDOR-NUMBER PIC 9(5).
001500     05 VENDOR-NAME PIC X(30).
001600     05 VENDOR-ADDRESS-1 PIC X(30).
001700     05 VENDOR-ADDRESS-2 PIC X(30).
001800     05 VENDOR-CITY PIC X(20).
001900     05 VENDOR-STATE PIC X(2).
002000     05 VENDOR-ZIP PIC X(10).
002100     05 VENDOR-CONTACT PIC X(30).
002200     05 VENDOR-PHONE PIC X(15).

