000100*in-line procedures
000200
000300*awk -i inplace '{printf("%04d00%s\n", NR, substr($0,7,120)) }' filename.cob
000400 IDENTIFICATION DIVISION. 
000500 PROGRAM-ID.  INLINEPROCEDURES.
000600 DATE-WRITTEN.  19-10-2024.
000700 DATE-COMPILED. 19-10-2024.
000800 AUTHOR. 
000900 ENVIRONMENT DIVISION.
001000  CONFIGURATION SECTION.
001100  SOURCE-COMPUTER. LINUXMINT21.
001200  OBJECT-COMPUTER. LINUXMINT21.
001300  INPUT-OUTPUT SECTION.
001400  FILE-CONTROL.
001500 DATA DIVISION. 
001600  FILE SECTION.
001700 WORKING-STORAGE SECTION.
001800*    need to add 's' for signed in front of pic clause for neg 
001900*    values in loop , and to obtain "0" counter
002000 77  WS_COUNTER          PIC s9999 VALUE 0.
002100 LOCAL-STORAGE SECTION. 
002200 77  LS_COUNTER          PIC 9999 VALUE 0. 
002300 PROCEDURE DIVISION. 
002400     000-BEGIN.
002500*        DISPLAY "DEBUGGING TEXT: IF DISPLAYED, PROGRAM RUNNING." 
002600         
002700         PERFORM 010-PROCEDURE1 thru  
002800                 010-PROCEDURE1 3 TIMES.
002900                 DISPLAY "HERE WE GO".
003000
003100        010-PROCEDURE1.
003200
003300         DISPLAY "COUNTING UPWARDS..."
003400         PERFORM VARYING WS_COUNTER FROM 1 UNTIL WS_COUNTER 
003500             IS GREATER THAN 4
003600             DISPLAY "COUNTER VALUE IS ", WS_COUNTER
003700         END-PERFORM.
003800
003900         DISPLAY "COUNTING DOWN NOW..."
004000         PERFORM VARYING WS_COUNTER FROM 4 BY -1 UNTIL WS_COUNTER
004100             IS LESS THAN 0
004200*           
004300             DISPLAY "COUNTER VALUE IS ", WS_COUNTER
004400         END-PERFORM. 
004500
004600   
004700         DISPLAY "PROGRAM ENDING"   
004800
004900         STOP RUN.
005000
005100 END PROGRAM INLINEPROCEDURES.
005200
005300
005400
005500
