      * Code for a selected records processing loop.
       PROCESS-VOUCHERS.
       PERFORM READ-FIRST-VALID-VOUCHER.
       PERFORM PROCESS-ALL-VOUCHERS
       UNTIL VOUCHER-FILE-AT-END = "Y".

       PROCESS-ALL-VOUCHERS.
       PERFORM PROCESS-THIS-VOUCHER.
       PERFORM READ-NEXT-VALID-VOUCHER.