000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ADD03.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION. 
000600 01  FIRST-NUMBER                PIC IS 99.
       01  SECOND-NUMBER               PIC IS 99.
       01  THE-RESULT                  PICTURE IS 999.

000700 PROCEDURE DIVISION. 
000800 PROGRAM-BEGIN.
           DISPLAY " This program will add 2 numbers.".
           DISPLAY "Enter the first number.".

           ACCEPT  FIRST-NUMBER.

           DISPLAY "ENTER THE SECOND NUMBER.".
           ACCEPT SECOND-NUMBER.

           COMPUTE THE-RESULT = FIRST-NUMBER + SECOND-NUMBER.

           DISPLAY "THE RESULT IS " THE-RESULT.

000900
001000 PROGRAM-DONE.
001100     STOP-RUN.

