       IDENTIFICATION DIVISION.
       PROGRAM-ID. 8Minutes.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "So, you coded for 4 hrs in Cobol today."
           DISPLAY "Not sure if I should offer congratulations..."
           DISPLAY " or condolences."
           DISPLAY "Four hours. Really?"
           STOP RUN.
