000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COMMISSION.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  SALES-AMOUNT           PIC 99V99.
000600 01  SALES-COMMISSION        PIC 99V99.
000700*01  TAX-INCLUDED           PIC 99V99.
000800 01  MORE-DATA              PIC XXX  VALUE 'YES'.
000900 PROCEDURE DIVISION.
001000 100-MAIN.
001100     PERFORM UNTIL MORE-DATA = 'NO'
001200         DISPLAY 'ENTER A SALES AMOUNT AS AN INTEGER'
001300         ACCEPT SALES-AMOUNT
001400         COMPUTE SALES-COMMISSION = .12 *
001500             SALES-AMOUNT               
001600         DISPLAY 'COMMISSION ON SALES ', SALES-COMMISSION               
001700         DISPLAY 'IS THERE MORE INPUT (YES OR NO)?'
001800         ACCEPT MORE-DATA 
001900     END-PERFORM
002000     STOP RUN.
002100
