000100 IDENTIFICATION DIVISION. 
000200 PROGRAM-ID. PROBLEMS6.
000300 ENVIRONMENT DIVISION.  
000400 INPUT-OUTPUT SECTION. 
000500 FILE-CONTROL.   SELECT PAYROLL-IN  ASSIGN TO CH1008. 
000600                 SELECT PAYROLL-OUT ASSIGN TO PRINTER.
000700
000800 DATA DIVISION.
000900 FILE SECTION. 
001000 FD  PAYROLL-IN. 
001100 01  PAYROLL-REC. 
001200     05 EMPLOYEE-NUMBER-IN           PICTURE 9(5).
001300     05 EMPLOYEE-NAME-IN             PICTURE X(20).
001400     05 LOCATION-CODE-IN             PICTURE 9999.
001500     05 ANNUAL-SALARY-IN             PICTURE 9(6).
001600 FD  PAYROLL-OUT.
001700 01  RECORD-OUT.
001800     05 EMPLOYEE-NUMBER-OUT          PICTURE 9(5).
001900     05 EMPLOYEE-NAME-OUT            PICTURE X(20).
002000     05 ANNUAL-SALARY-OUT            PICTURE 9(6).
002100 WORKING-STORAGE SECTION.
002200 01  ARE-THERE-MORE-RECORDS          PICTURE X(3) VALUE 'YES'.
002300 PROCEDURE DIVISION.
002400 100-MAIN-MODULE.
002500     OPEN INPUT  PAYROLL-IN 
002600          OUTPUT PAYROLL-OUT
002700     PERFORM  UNTIL ARE-THERE-MORE-RECORDS = 'NO'
002800             READ PAYROLL-IN 
002900                 AT END 
003000                         MOVE 'NO' TO ARE-THERE-MORE-RECORDS 
003100                 NOT AT END 
003200                         PERFORM 200-WAGE-ROUTINE 
003300
003400                 END-READ 
003500     END-PERFORM 
003600     CLOSE PAYROLL-IN 
003700           PAYROLL-OUT 
003800     STOP RUN. 
003900 200-WAGE-ROUTINE.
004000     MOVE EMPLOYEE-NUMBER-IN TO EMPLOYEE-NUMBER-OUT 
004100     MOVE EMPLOYEE-NAME-IN TO EMPLOYEE-NAME-OUT 
004200     ADD 1000, ANNUAL-SALARY-OUT 
004300         GIVING ANNUAL-SALARY-OUT 
004400     WRITE RECORD-OUT. 
004500     
004600     
