000100 IDENTIFICATION DIVISION. 
000200 PROGRAM-ID. PROBLEM5.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL. SELECT SALES-FILE ASSIGN TO SALES-DAT.
000600               SELECT PRINT-FILE ASSIGN TO PRINTER. 
000700 DATA DIVISION. 
000800 FILE SECTION. 
000900 FD  SALES-FILE.
001000 01  SALES-REC.
001100     05  NAME-IN 			    PICTURE X(15).
001200     05  AMOUNT-OF-SALES-IN PICTURE 999V99.
001300 FD  PRINT-FILE.
001400 01  PRINT-REC.
001500     05                     PICTURE X(20).
001600     05 NAME-OUT            PICTURE X(15).
001700     05                     PICTURE X(20). 
001800     05 AMT-COMMISSION-OUT  PICTURE 99.99.
001900     05                     PICTURE X(72).
002000 WORKING-STORAGE SECTION. 
002100 01  ARE-THERE-MORE-RECORDS PICTURE XXX VALUE 'YES'.
002200 PROCEDURE DIVISION. 
002300 100-MAIN-MODULE. 
002400     OPEN INPUT SALES-FILE
002500       OUTPUT PRINT-FILE
002600     PERFORM UNTIL ARE-THERE-MORE-RECORDS = 'NO'
002700         READ SALES-FILE
002800             AT END
002900                 MOVE 'NO' TO ARE-THERE-MORE-RECORDS
003000             NOT AT END
003100                 PERFORM 200-COMMISSION-RTN
003200         END-READ
003300     END-PERFORM
003400     CLOSE SALES-FILE
003500       PRINT-FILE
003600     STOP RUN.
003700 200-COMMISSION-RTN. 
003800     MOVE SPACES TO PRINT-REC
003900     MOVE NAME-IN TO NAME-OUT
004000     IF AMOUNT-OF-SALES-IN IS GREATER THAN 100.00
004100        MULTIPLY .03 BY AMOUNT-OF-SALES-IN 
004200             GIVING AMT-COMMISSION-OUT 
004300     ELSE 
004400         MULTIPLY .02 BY AMOUNT-OF-SALES-IN 
004500             GIVING AMT-COMMISSION-OUT 
004600     END-IF  
004700     WRITE PRINT-REC. 
004800     
004900
005000     
005100     
005200
005300     
005400
005500    
005600
005700
