000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SALES.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  SALES-AMOUNT           PIC 99V99.
000600 01  SALES-TAX              PIC 99V99.
000700 01  TAX-INCLUDED           PIC 99V99.
000800 01  MORE-DATA              PIC XXX  VALUE 'YES'.
000900 PROCEDURE DIVISION.
001000 100-MAIN.
001100     PERFORM UNTIL MORE-DATA = 'NO'
001200         DISPLAY 'ENTER A SALES AMOUNT AS AN INTEGER'
001300         ACCEPT SALES-AMOUNT
001400         COMPUTE SALES-TAX = .08 *
001500             SALES-AMOUNT
001600         COMPUTE TAX-INCLUDED = SALES-AMOUNT + SALES-TAX 
001700         DISPLAY 'SALES TAX ', SALES-TAX
001800         DISPLAY 'SALES AMOUNT INCLUDING SALES-TAX ', TAX-INCLUDED
001900         DISPLAY 'IS THERE MORE INPUT (YES OR NO)?'
002000         ACCEPT MORE-DATA 
002100     END-PERFORM
002200     STOP RUN.
002300
002400
