000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SAMPLE.
000300 ENVIRONMENT DIVISION. 
000400 INPUT-OUTPUT SECTION. 
000500 FILE-CONTROL. SELECT EMPLOYEE-DATA      ASSIGN TO EMP-DAT.
000600               SELECT PAYROLL-LISTING    ASSIGN TO PRINTER.
000700 DATA DIVISION.
000800 FILE SECTION.
000900 FD  EMPLOYEE-DATA.
001000 01  EMPLOYEE-RECORD.
001100     05 EMPLOYEE-NAME-IN         PICTURE X(20).
001200     05 HOURS-WORKED-IN          PICTURE 9(2).
001300     05 HOURLY-RATE-IN           PICTURE 9V99.
001400 FD  PAYROLL-LISTING.
001500 01  PRINT-REC.
001600     05                          PICTURE X(20).
001700     05 NAME-OUT                 PICTURE X(20).
001800     05                          PICTURE X(10).
001900     05 HOURS-OUT                PICTURE 9(2).
002000     05                          PICTURE X(8).
002100     05 RATE-OUT                 PICTURE 9.99.
002200     05                          PICTURE X(6).
002300     05 WEEKLY-WAGES-OUT         PICTURE 999.99.
002400 WORKING-STORAGE SECTION.
002500 01  ARE-THERE-MORE-RECORDS      PICTURE XXX VALUE 'YES'.
002600 PROCEDURE DIVISION.
002700 100-MAIN-MODULE.
002800     OPEN INPUT EMPLOYEE-DATA    
002900          OUTPUT PAYROLL-LISTING
003000     PERFORM UNTIL ARE-THERE-MORE-RECORDS = 'NO'
003100         READ EMPLOYEE-DATA 
003200             AT END 
003300                 MOVE 'NO' TO ARE-THERE-MORE-RECORDS
003400             NOT AT END 
003500                 PERFORM 200-WAGE-ROUTINE 
003600          END-READ 
003700     END-PERFORM 
003800     CLOSE EMPLOYEE-DATA 
003900           PAYROLL-LISTING 
004000     STOP RUN.
004100 200-WAGE-ROUTINE.
004200     MOVE SPACES TO PRINT-REC 
004300     MOVE EMPLOYEE-NAME-IN TO NAME-OUT 
004400     MOVE HOURS-WORKED-IN TO RATE-OUT 
004500     MOVE HOURLY-RATE-IN TO RATE-OUT
004600     MULTIPLY HOURS-WORKED-IN BY HOURLY-RATE-IN 
004700             GIVING WEEKLY-WAGES-OUT 
004800     WRITE PRINT-REC.
004900     
005000                      
005100
005200
005300
005400 
005500     
