      * Changes for vninnm03.cbl
       PROGRAM-BEGIN. 
           PERFORM OPENING-PROCEDURE. 
           PERFORM MAIN-PROCESS.
           PERFORM CLOSING-PROCEDURE.

       PROGRAM-EXIT. 
           EXIT PROGRAM.

       PROGRAM-DONE. 
           STOP RUN. 
           