      * Fixing the SELECT and FD in vndrpt04.cbl
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. VNDRPT04.
000300*--------------------------------
000400* Report on the Vendor File.
000500*--------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000
           COPY "SLVND02.CBL".
001100
001200
           COPY "SLSTATE.CBL".
001300
001400
           SELECT PRINTER-FILE
001500
           ASSIGN TO PRINTER
001600
           ORGANIZATION IS LINE SEQUENTIAL.
001700
001800 DATA DIVISION.
001900 FILE SECTION.
002000
002100
           COPY "FDVND04.CBL".
002200
002300
           COPY "FDSTATE.CBL".
           
