       FD STATE-FILE
000800
       LABEL RECORDS ARE STANDARD.
000900 01 STATE-RECORD.
           05 STATE-CODE           PIC X(2).
           05 STATE-NAME           PIC X(19).
           05 STATE-CONTINENTAL    PIC X(1).
           