      * Using PERFORM VARYING UNTIL 

      * The 3 steps of process loop control (loops) are so common 
      * that the PERFORM verb has been extended to allow the first and
      * last steps to be incorporated directly into the PERFORM verb. 

      * PERFORM a paragraph
      * VARYING a variable 
      * FROM   a valube BY a value 
      * UNTIL  a condition. 

      *  Example: 
      * PERFORM CALCULATE-AND-DISPLAY 
      * VARYING THE-MULTIPLIER 
      * FROM 1 BY 1 
      * UNTIL THE-MULTIPLIER > 12 

      * Using PERFORM UNTIL in a loop 
003700 MOVE 1 TO THE-MULTIPLIER.
003800 PERFORM CALCULATE-AND-DISPLAY
003900
004000 UNTIL THE-MULTIPLIER > 12.
004100
004200 CALCULATE-AND-DISPLAY.
004300 COMPUTE THE-PRODUCT = THE-NUMBER * THE-MULTIPLIER.
004400 DISPLAY
004500 THE-NUMBER " * " THE-MULTIPLIER " = " THE-PRODUCT.
004600 ADD 1 TO THE-MULTIPLIER

      * USING PERFORM VARYING UNTIL 
003700
003800 PERFORM CALCULATE-AND-DISPLAY
003900 VARYING THE-MULTIPLIER FROM 1 BY 1
004000 UNTIL THE-MULTIPLIER > 12.
004100
004200 CALCULATE-AND-DISPLAY.
004300 COMPUTE THE-PRODUCT = THE-NUMBER * THE-MULTIPLIER.
004400 DISPLAY
004500 THE-NUMBER " * " THE-MULTIPLIER " = " THE-PRODUCT.

