      * Bonus Day 1
      * Control Break Variables 
      *---------------------------
      * The total for  control breaks 
      *--------------------------------
       77  ABC-TOTAL               PIC S9(6)V99. 
       77  PHONE-TOTAL             PIC S9(6)V99. 
       77  MOON-TOTAL              PIC S9(6)V99. 
       77  GRAND-TOTAL             PIC S9(6)V99. 
       
