000100 IDENTIFICATION DIVISION.
000200*
000300 PROGRAM-ID. RPT1000.
000400*
000500 ENVIRONMENT DIVISION.
000600*
000700 INPUT-OUTPUT SECTION. 
000800*
000900 FILE-CONTROL. 
001000*
001100     SELECT CUSTMAST ASSIGN TO "C:\COBOL\DATA\CUSTMAST.DAT".
001200     SELECT SALESRPT ASSIGN TO "C:\COBOL\DATA\SALESRPT.PRN".
001300*
001400     DATA DIVISION.
001500*
001600     FILE SECTION.
001700*    
001800     FD CUSTMAST.        
001900* 
002000 01  CUSTOMER-MASTER-RECORD.
002100     05 CM-BRANCH-NUMBER     PIC 9(2).
002200     05 CM-SALESREP-NUMBER   PIC 9(2).
002300     05 CM-CUSTOMER-NUMBER   PIC 9(5).
002400     05 CM-CUSTOMER-NAME     PIC X(20).
002500     05 CM-SALES-THIS-YTD    PIC S9(5)v9(2).
002600     05 CM-SALES-LAST-YTD    PIC S9(5)v9(2).
002700*
002800     FD SALESRPT.
002900*    
003000 01  PRINT-AREA      PIC X(132).
003100*
003200 WORKING-STORAGE SECTION.
003300*
003400 01  SWITCHES.
003500     05 CUSTMAST-EOF-SWITCH  PIC  X VALUE "N".
003600*
003700 01  PRINT-FIELDS.
003800     05  PAGE-COUNT          PIC S9(3)  VALUE ZERO.
003900     05  LINES-ON-PAGE       PIC S9(3)  VALUE +55.
004000     05  LINE-COUNT          PIC S9(3)  VALUE +99.
004100     05  SPACE-CONTROL       PIC S9.
004200*
004300 01  TOTAL-FIELDS.
004400     05  GRAND-TOTAL-THIS-YTD PIC S9(7)V99   VALUE ZERO.
004500     05  GRAND-TOTAL-LAST-YTD PIC S9(7)V99   VALUE ZERO.
004600*
004700 01  CURRENT-DATE-AND-TIME.
004800     05 CD-YEAR          PIC 9999.
004900     05 CD-MONTH         PIC 99.
005000     05 CD-DAY           PIC 99.
005100     05 CD-HOURS         PIC 99.
005200     05 CD-MINUTES       PIC 99.
005300     05 FILLER           PIC X(9).
005400*    
005500 01  HEADING-LINE-1.
005600     05 FILLER           PIC X(7)    VALUE "DATE:  ".       
005700     05 HL1-MONTH        PIC 9(2).
005800     05 FILLER           PIC X(1)    VALUE "/".
005900     05 HL1-DAY          PIC 9(2).
006000     05 FILLER           PIC X(1)    VALUE "/".
006100     05 HL1-YEAR         PIC 9(4).
006200     05 FILLER           PIC X(11)   VALUE SPACE.
006300     05 FILLER           PIC X(20)   VALUE "YEAR-TO-DATE SALES R".
006400     05 FILLER           PIC X(20)   VALUE "EPORT               ".
006500     05 FILLER           PIC X(8)    VALUE "  PAGE: ".
006600     05 HL1-PAGE-NUMBER  PIC ZZZ9.
006700     05 FILLER           PIC X(52)   VALUE SPACE.
006800*    
006900 01  HEADING-LINE-2.
007000     05 FILLER           PIC X(7)        VALUE  "TIME:  ".
007100     05 HL2-HOURS        PIC 9(2).
007200     05 FILLER           PIC X(1)        VALUE  ":".
007300     05 HL2-MINUTES      PIC 9(2).
007400     05 FILLER           PIC X(58)       VALUE SPACE.
007500     05 FILLER           PIC X(10)       VALUE "RPT1000".
007600     05 FILLER           PIC X(52)       VALUE SPACE.
007700*    
007800 01  HEADING-LINE-3.
007900     05  FILLER          PIC X(20)       VALUE "CUST        ".
008000     05  FILLER          PIC X(20)       VALUE "     SALES  ".
008100     05  FILLER          PIC X(20)       VALUE "   SALES    ".
008200     05  FILLER          PIC X(72)       VALUE SPACE.
008300*
008400 01  HEADING-LINE-4.
008500     05  FILLER          PIC X(20) VALUE "NUM CUSTOMER NAME".
008600     05  FILLER          PIC X(20) VALUE "         THIS YTD".
008700     05  FILLER          PIC X(20) VALUE "    LAST YTD     ".
008800     05  FILLER          PIC X(72) VALUE SPACE.
008900*    
009000 01  CUSTOMER-LINE.
009100     05 CL-CUSTOMER-NUMBER   PIC 9(5).
009200     05 FILLER               PIC X(2)         VALUE SPACE.
009300     05 CL-CUSTOMER-NAME     PIC X(20).
009400     05 FILLER               PIC X(3)         VALUE SPACE.
009500     05 CL-SALES-THIS-YTD    PIC ZZ,ZZ9.99-.
009600     05 FILLER               PIC X(4)         VALUE SPACE.
009700     05 CL-SALES-LAST-YTD    PIC ZZ,ZZ9.99-.
009800     05 FILLER               PIC X(78)        VALUE SPACE.
009900*
010000 01  GRAND-TOTAL-LINE.
010100     05 FILLER               PIC X(2)         VALUE SPACE.
010200     05 GTL-SALES-THIS-YTD   PIC Z,ZZZ,ZZ9.99-.
010300     05 FILLER               PIC X(1)         VALUE SPACE. 
010400     05 GTL-SALES-LAST-YTD   PIC Z,ZZZ,ZZ9.99-.
010500     05 FILLER               PIC X(78)        VALUE SPACE. 
010600*    
010700 PROCEDURE DIVISION. 
010800*
010900 000-PREPARE-SALES-REPORT.
011000*
011100     OPEN INPUT CUSTMAST
011200          OUTPUT SALESRPT.
011300     PERFORM 100-FORMAT-REPORT-HEADING. 
011400     PERFORM 200-PREPARE-SALES-LINES 
011500             UNTIL CUSTMAST-EOF-SWITCH = "Y".
011600     PERFORM 300-PRINT-GRAND-TOTALS.
011700     CLOSE   CUSTMAST
011800             SALESRPT.
011900     STOP RUN.
012000* 
012100 100-FORMAT-REPORT-HEADING.
012200*
012300     MOVE FUNCTION CURRENT-DATE TO CURRENT-DATE-AND-TIME.
012400     MOVE CD-MONTH       TO HL1-MONTH.
012500     MOVE CD-DAY         TO HL1-DAY.
012600     MOVE CD-YEAR        TO HL1-YEAR.
012700     MOVE CD-HOURS       TO HL2-HOURS.
012800     MOVE CD-MINUTES     TO HL2-MINUTES.
012900*
013000 200-PREPARE-SALES-LINES.
013100*
013200     PERFORM 210-READ-CUSTOMER-RECORD.
013300     IF CUSTMAST-EOF-SWITCH = "N"
013400         PERFORM 220-PRINT-CUSTOMER-LINE.
013500*    
013600 210-READ-CUSTOMER-RECORD.
013700*
013800     READ CUSTMAST
013900         AT END
014000             MOVE "Y" TO CUSTMAST-EOF-SWITCH.
014100*
014200 220-PRINT-CUSTOMER-LINE.
014300*
014400     IF LINE-COUNT >= LINES-ON-PAGE
014500         PERFORM 230-PRINT-HEADING-LINES.
014600     MOVE CM-CUSTOMER-NUMBER  TO CL-CUSTOMER-NUMBER.
014700     MOVE CM-CUSTOMER-NAME    TO CL-CUSTOMER-NAME.
014800     MOVE CM-SALES-THIS-YTD   TO CL-SALES-THIS-YTD.
014900     MOVE CM-SALES-LAST-YTD   TO CL-SALES-THIS-YTD.
015000     MOVE CUSTOMER-LINE TO PRINT-AREA.
015100     WRITE PRINT-AREA AFTER ADVANCING SPACE-CONTROL LINES.
015200     ADD 1 TO LINE-COUNT.
015300     ADD CM-SALES-THIS-YTD TO GRAND-TOTAL-THIS-YTD.
015400     ADD CM-SALES-LAST-YTD TO GRAND-TOTAL-LAST-YTD.
015500     MOVE 1 TO SPACE-CONTROL.
015600*
015700 230-PRINT-HEADING-LINES. 
015800*    
015900     ADD 1 TO PAGE-COUNT. 
016000     MOVE PAGE-COUNT        TO HL1-PAGE-NUMBER.
016100     MOVE HEADING-LINE-1    TO PRINT-AREA.
016200     WRITE PRINT-AREA AFTER ADVANCING PAGE.
016300     MOVE HEADING-LINE-2 TO PRINT-AREA.
016400     WRITE PRINT-AREA AFTER ADVANCING 1 LINES.
016500     MOVE HEADING-LINE-3 TO PRINT-AREA.
016600     WRITE PRINT-AREA AFTER ADVANCING 2 LINES.
016700     MOVE HEADING-LINE-4 TO PRINT-AREA.
016800     WRITE PRINT-AREA AFTER ADVANCING 1 LINES.
016900     MOVE ZERO TO LINE-COUNT.
017000     MOVE 2 TO SPACE-CONTROL.
017100*
017200 300-PRINT-GRAND-TOTALS.
017300*    
017400     MOVE GRAND-TOTAL-THIS-YTD TO GTL-SALES-THIS-YTD.
017500     MOVE GRAND-TOTAL-LAST-YTD TO GTL-SALES-LAST-YTD.
017600     MOVE GRAND-TOTAL-LINE     TO PRINT-AREA.
017700     WRITE PRINT-AREA AFTER ADVANCING 2 LINES.

017800
017900
018000     
018100     
018200     
018300
018400
018500
018600
018700
018800
