000100*test if awk command works
000200 IDENTIFICATION DIVISION.
000400 PROGRAM-ID. HELLOWORLD.
000500 AUTHOR. HAL9000.
       DATE-WRITTEN. 01/03/2024.
       DATE-COMPILED. 01/03/2024.
       REMARKS. This program is a demonstration of hello world.
000900*
       ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SOURCE-COMPUTER. Mint_Cinnamon_Linux_Oubuntu_21_0_Vanessa.
001300 OBJECT-COMPUTER. Mint_Cinnamon_Linux_Oubuntu_21_0_Vanessa.
001400 INPUT-OUTPUT SECTION.
001500 FILE-CONTROL.
001600 I-O-CONTROL.

001800 DATA DIVISION.
001900 FILE SECTION.
002000 WORKING-STORAGE SECTION.
002100 LINKAGE SECTION.
026000       DISPLAY "Hello World, from GNU Cobol."
             STOP RUN.

        

