000100* sanity check to see if SIN intrinsic is working properly
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. SINTEST.
000400 AUTHOR. SPEEDRACER&MRX.
000500 DATE-WRITTEN. 23.3.2024.
000600 DATE-COMPILED. 23.3.2024.
000700 REMARKS. This program is a demo of SIN INTRINSIC.
000800*
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SOURCE-COMPUTER. Mint_Cinnamon_Linux_Oubuntu_21_0_Vanessa.
001200 OBJECT-COMPUTER. Mint_Cinnamon_Linux_Oubuntu_21_0_Vanessa.
001300 REPOSITORY.
001400* N.B.:! only add '.' after final function below.
001500     FUNCTION ALL INTRINSIC.
001600*    FUNCTION SIN INTRINSIC
001700*    FUNCTION PI  INTRINSIC.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000 I-O-CONTROL.
002100*
002200 DATA DIVISION.
002300 FILE SECTION.
002400 WORKING-STORAGE SECTION.
002500 77 COMP1_VAR1           USAGE IS COMP-1 value 0.
002600 77 RadiansVar           USAGE IS COMP-1 value 0.
002700 LINKAGE SECTION.
002800*Report and SCREEN sections not available with IBM x86.
002900 REPORT SECTION.
003000 SCREEN SECTION. 
003100*
003200 PROCEDURE DIVISION.
003300       DISPLAY "Hello World, from GNU Cobol."
003400     add 1 to COMP1_VAR1.
003500     Display "Comp-1 Var-1 is: ", COMP1_VAR1.
003600     compute RadiansVar = (90.0 * FUNCTION PI)/180.0
003700*
003800     move SIN(RadiansVar) to COMP1_VAR1.
003900     DISPLAY "The SIN of 90 degrees is: ", COMP1_VAR1.
004000*This returns 1, in line with SIN function oddly enough..     
004100     move COS(RadiansVar) to COMP1_VAR1.
004200     DISPLAY "The Cosine of 90 degrees is: ", COMP1_VAR1.
004300
004400    
004500     STOP RUN.
004600 END PROGRAM SINTEST. 
004700
004800  
004900
