      * LEVEL 77 
      * A variable that is not a structure can be given a level 
      * number of 77 instead of 01. 
      *77  YES-NO        PIC X. 

      *Alternative to cmpint04 file uisng level 77
000800 WORKING-STORAGE SECTION.
000900
001000
001100 77  YES-NO PIC X.
001200 77  ENTRY-OK PIC X.
001300
001400
001500 77  THE-INTEREST PIC 99V9.
001600 77  INTEREST-AS-DECIMAL PIC V999.
001700 77  THE-PRINCIPAL PIC 9(9)V99.
001800 77  WORKING-PRINCIPAL PIC 9(9)V99.
001900 77  THE-NEW-VALUE PIC 9(9)V99.
002000 77  EARNED-INTEREST PIC 9(9)V99.
002100 77  THE-PERIOD PIC 9999.
002200 77  NO-OF-PERIODS PIC 999.
002300 
002400 77  ENTRY-FIELD PIC ZZZ,ZZZ,ZZZ.ZZ.
002500
002600 01 THE-WHOLE-MESSAGE.
002700     05 DISPLAY-PRINCIPAL PIC ZZZ,ZZZ,ZZ9.99.
002800     05 MESSAGE-PART-01 PIC X(4) VALUE " at ".
002900     05 DISPLAY-INTEREST PIC Z9.9.
003000     05 MESSAGE-PART-02 PIC X(6) VALUE "% for ".
003100     05 DISPLAY-PERIODS PIC ZZ9.
003200     05 MESSAGE-PART-03 PIC X(16)
003300         VALUE " periods yields ".
003400     05 DISPLAY-VALUE PIC ZZZ,ZZZ,ZZ9.99.

