      * A new COBOL Shell
       IDENTIFICATION DIVISION. 
       PROGRAM-ID. COBSHL03.
      *-------------------------------------------------------
      * Comments go here.
      *-------------------------------------------------------

       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL. 

       DATA DIVISION. 
       FILE SECTION. 

       WORKING-STORAGE SECTION. 

       PROCEDURE-DIVISION. 
       PROGRAM-BEGIN. 

       PROGRAM-DONE.
           STOP RUN. 
       