000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO05.
000300 
000400*This program illustrates the incorrect placement of a 
      * Paragraph that is the target of a PERFORM.
000600  
000700 ENVIRONMENT DIVISION.
000800 DATA DIVISION.
000900 PROCEDURE DIVISION.
001000
001100 PROGRAM-BEGIN.
001200     DISPLAY "Today's message is:".
001300     PERFORM SAY-HELLO.
001400     
001500 SAY-HELLO.
001600     DISPLAY "HELLO COBOL".
001700
001800 PROGRAM-DONE.
001900     STOP-RUN.


     
