      * A calling program 
      000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TIME02.
000300*--------------------------------
000400* Testing Time Entry and handling
000500*--------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400
001500 77 ANY-TIME  PIC 9(6) VALUE ZEROES.
001600
001700 77 ANY-FORMATTED  PIC X(8).
001800
001900 77 FORMATTED-TIME  PIC Z9/99/99.
002000
002100 77 THE-TIME  PIC 9(6).
002200
002300 77 ZERO-IS-OK  PIC X VALUE "N".
002400
002500 PROCEDURE DIVISION.
002600 PROGRAM-BEGIN.
002700
           PERFORM OPENING-PROCEDURE.
           PERFORM MAIN-PROCESS.
           PERFORM CLOSING-PROCEDURE.

       PROGRAM-EXIT.
           EXIT PROGRAM.

       PROGRAM-DONE.
        STOP RUN.

       003700 OPENING-PROCEDURE.

       003900 CLOSING-PROCEDURE.

       004100 MAIN-PROCESS.

           PERFORM GET-ANY-TIME.

           PERFORM DISPLAY-AND-GET-ANY-TIME
           UNTIL ANY-TIME = 000001.

       GET-ANY-TIME.
           MOVE "Y" TO ZERO-IS-OK.
           PERFORM GET-THE-TIME.
           MOVE THE-TIME TO ANY-TIME.
           MOVE FORMATTED-TIME TO ANY-FORMATTED.

       GET-THE-TIME.
           CALL "TIMEDIT" USING
           THE-TIME FORMATTED-TIME
           ZERO-IS-OK.

       DISPLAY-AND-GET-ANY-TIME.
           PERFORM DISPLAY-THE-TIME.
           PERFORM GET-ANY-TIME.        
       DISPLAY-THE-TIME.
           DISPLAY "ANY TIME IS " ANY-FORMATTED.
           