      * B2.2 WORKING-STORAGE for a division table
       01  DIVISION-TABLE OCCURS 3 TIMES 
            INDEXED BY DIVISION-INDEX.
           05 DIVISION-NUMBER      PIC 99.
           05 DIVISION-NAME    PIC X(15).
           