      * The menu screen 
       01  MENU-SCREEN.
           05 BLANK SCREEN. 
           05 LINE 2 COLUMN  30 VALUE "VENDOR MAINTENANCE".
           05 LINE 6 COLUMN  20 VALUE "PLEASE SELECT:".
           05 LINE 8 COLUMN  25 VALUE "1. ADD RECORDS".
           05 LINE 9 COLUMN  25 VALUE "2. CHANGE A RECORD".
           05 LINE 10 COLUMN 25 VALUE "3. LOOK UP A RECORD".
           05 LINE 11 COLUMN 25 VALUE "4. DELETE A RECORD".
           05 LINE 12 COLUMN 25 VALUE "5. LOOK UP A NAME".
           05 LINE 13 COLUMN 25 VALUE "6. PRINT RECORDS".
           05 LINE 14 COLUMN 25 VALUE "7. PRINT IN NAME ORDER".
           05 LINE 15 COLUMN 25 VALUE "8. DISPLAY ALL RECORDS".
           05 LINE 17 COLUMN 25 VALUE "0. EXIT".
           05 LINE 20 COLUMN 1 VALUE  "YOUR SELECTION?".
           05 LINE 20 COLUMN 17 PIC Z USING MENU-PICK. 
           05 LINE 24 COLUMN 1 PIC X(79) FROM ERROR-MESSAGE.
           
