      * A REDEFINITION. 
       01  AN-X-FIELD              PIC X(6).
       01  A-9-FIELD REDEFINES    
           AN-X-FIELD              PIC 9(6).
           