      * The final date REDEFINES. 
       01  DATE-CCYYMMDD           PIC 9(8). 
       01  FILLER REDEFINES DATE-CCYYMMDD. 
           05 DATE-CC              PIC 99. 
           05 DATE-YY              PIC 99. 
           05 DATE-MM              PIC 99. 
           05 DATE-DD              PIC 99. 
           