      * Formatting a date field with slashes 
       77  FORMATTED-DATE          PIC 99/99/9999.

           MOVE 05151997 TO FORMATTED-DATE.
           DISPLAY FORMATTED-DATE.