      * TWO VARIABLES FOR THE CONTROL BREAKS 
       77  VENDOR-TOTAL                    PIC S9(6)V99. 
       77  GRAND-TOTAL                     PIC S9(6)V99. 
       