      * The continuation character
       01  LONG-MESSAGE     PIC X(80) VALUE "This is an incredibly
      - long message that will take more than one line to define".
