      * Loaing a table in the program 
 
           MOVE 1 TO DIVISION-NUMBER(1).           
           MOVE "ATHLETICS" TO DIVISION-NAME(1).           
           MOVE 2 TO DIVISION-NUMBER(2).           
           MOVE "SPORTING GOODS" TO DIVISION-NAME(2).           
           MOVE 3 TO DIVISION-NUMBER(3).           
           MOVE "CAMPING" TO DIVISION-NAME(3).
           