      * Creating the needed values in WORKING-STORAGE.
       01  THE-DIVISIONS.
       05 FILLER        PIC 99 VALUE 01.
      
       05 FILLER        PIC X(15) VALUE "ATHLETICS".
      
       05 FILLER        PIC 99 VALUE 02.
      
       05 FILLER        PIC X(15) VALUE "SPORTING GOODS".
      
       05 FILLER        PIC 99 VALUE 01.
      
       05 FILLER        PIC X(15) VALUE "CAMPING".
       