       * The data definition of three names 
       01  THE-NAME 
           05 LAST-NAME        PIC X(10).
           05 FIRST-NAME       PIC X(10).
           05 MIDDLE-NAME      PIC X(10).
           