      * Examples fo using table (array) variables.

           MOVE SPACE TO TABLE-STATE-RECORD(5).
           MOVE STATE-CODE TO TABLE-STATE-CODE(1).
           MOVE STATE-NAME TO TABLE-STATE-NAME(15).
           DISPLAY TABLE-STATE-NAME(23).
           MOVE TABLE-STATE-CODE(43) TO PRINT-CODE.
           