      * Entering VENDOR-ADDRESS-1

       ENTER-VENDOR-ADDRESS-1.
           PERFORM ACCEPT-VENDOR-ADDRESS-1.
           PERFORM RE-ACCEPT-VENDOR-ADDRESS-1
               UNTIL VENDOR-ADDRESS-1 NOT = SPACE.

       ACCEPT-VENDOR-ADDRESS-1.
           DISPLAY "ENTER VENDOR ADDRESS-1".
           ACCEPT VENDOR-ADDRESS-1.
           INSPECT VENDOR-ADDRESS-1
               CONVERTING LOWER-ALPHA 
               TO           UPPER-ALPHA.

       RE-ACCEPT-VENDOR-ADDRESS-1.
           DISPLAY "VENDOR ADDRESS-1 MUST BE ENTERED".
           PERFORM ACCEPT-VENDOR-ADDRESS-1.
           