000100 IDENTIFICATION DIVISION. 
000200 PROGRAM-ID. ASSIGNMENT2.
000300 AUTHOR. Mr.X.
000400 DATE-WRITTEN.
000500 DATE-COMPILED.  17.Oct.2024       
000600*******************************************
000700*****                                  ****
000800*******************************************
000900 ENVIRONMENT DIVISION. 
001000 CONFIGURATION SECTION. 
001100 SOURCE-COMPUTER. LINUX_MINT_21_UBUNTU_GnuCOBOL_v3_2_0.
001200 OBJECT-COMPUTER. LINUX_MINT_21_UBUNTU_GnuCOBOL_v3_2_0.
001300 INPUT-OUTPUT SECTION. 
001400 FILE-CONTROL.
001500     SELECT TRANS-FILE 
001600         ASSIGN TO '/home/s/COBOL/temp/TRANS.DAT'.
001700     SELECT SALES-FILE 
001800         ASSIGN TO PRINTER. 
001900 DATA DIVISION. 
002000 FILE SECTION. 
002100 FD  TRANS-FILE.
002200 01  TRANS-REC. 
002300     05 NAME-IN              PIC X(20).
002400     05 UNIT-PRICE-IN        PIC 9(3)V99.
002500     05 QTY-SOLD-IN          PIC 999.
002600 FD  SALES-FILE.
002700 01  SALES-REC.
002800     05 NAME-OUT             PIC X(20).
002900     05 TOTAL-PRICE-OUT      PIC 9(6)V99.
003000 WORKING-STORAGE SECTION. 
003100 01  ARE-THERE-MORE-RECORDS  PIC X(3) VALUE 'YES'.
003200 PROCEDURE DIVISION. 
003300 100-MAIN-MODULE.
003400     OPEN INPUT TRANS-FILE
003500          OUTPUT SALES-FILE 
003600     PERFORM UNTIL ARE-THERE-MORE-RECORDS = 'NO '
003700        READ TRANS-FILE 
003800              AT END 
003900                     MOVE 'NO' TO ARE-THERE-MORE-RECORDS
004000              NOT AT END 
004100                     PERFORM 200-CALC-RTN 
004200        END-READ 
004300     END-PERFORM
004400     CLOSE TRANS-FILE 
004500           SALES-FILE 
004600     STOP RUN. 
004700 200-CALC-RTN. 
004800     MOVE NAME-IN TO NAME-OUT
004900     MULTIPLY UNIT-PRICE-IN BY QTY-SOLD-IN GIVING TOTAL-PRICE-OUT
005000     WRITE SALES-REC. 
005100
