      * Printing Basics 
      * A SELECT statement for  a file. 
 00400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT PHONE-FILE
000800         ASSIGN TO "phone.dat"
000900         ORGANIZATION IS SEQUENTIAL.
001000
001100 DATA DIVISION.
      * A SELECT statement for a print file 
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT PHONE-FILE
000800         ASSIGN TO PRINTER
000900         ORGANIZATION IS LINE SEQUENTIAL.
001000
001100 DATA DIVISION.

      * File definition for a data file 
  002  DATA DIVISION.
002100 FILE SECTION.
002200 FD PHONE-FILE
002300     LABEL RECORDS ARE STANDARD.
002400 01 PHONE-RECORD.
002500     05 PHONE-LAST-NAME PIC X(20).
002600     05 PHONE-FIRST-NAME PIC X(20).
002700     05 PHONE-NUMBER PIC X(15).
002800     05 PHONE-EXTENSION PIC X(5).

      * The file definition for a printer file
       FD PRINTER-FILE
003100     LABEL RECORDS ARE OMITTED.
003200 01  PRINTER-RECORD PIC X(80).

