      * An extreme example of changing the FD
      000700 FD  THE-FILE

       LABEL RECORDS ARE STANDARD.
       01   THE-RECORD.
           05 THE-KEY              PIC X(2).
           05 FIRST-5-OF-NAME      PIC X(5).
           05 2ND-5-OF-NAME        PIC X(5).
           05 LAST-10-OF-NAME      PIC X(10).
           